Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendArcLength.#ctor(Autodesk.Revit.DB.ElementId)
Create a 180-degree bend constraint driven by arc length.
paramId:
The Id of a Rebar Shape parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012